#+TITLE: ivns-grammar
#+AUTHOR: Olivia Ibañez Mustelier

*** =check-ambiguity=

Esta función conserva el nombre usado en versiones anteriores del proyecto,
pero en la versión actual funciona como una validación estructural.

Su objetivo es detectar si una cadena IVNS puede interpretarse de forma
segura antes de traducirla a acciones.

Por ejemplo, rechaza casos como:

- insertar un cliente sin haber seleccionado uno antes;
- intercambiar dos clientes cuando solo hay uno disponible;
- insertar una subruta sin haber seleccionado una subruta;
- terminar la cadena dejando clientes o subrutas sin consumir.

La función devuelve tres valores:

1. si existe un problema estructural;
2. la cadena analizada;
3. la razón textual de la decisión.

Esta función ayuda a explicar por qué una cadena generada no debe llegar
a la fase de construcción del criterio VRP.

#+BEGIN_SRC lisp :tangle ../src/ivns-sequence-interpreter.lisp
(in-package :ivns)

(defun ivns-complexity-score (cadena)

  "Calcula una medida simple de complejidad para una cadena IVNS."

  (if (or (null cadena)
          (not (stringp cadena)))

      0

      (let ((score 0))

        ;; costo base por longitud
        (incf score
              (length cadena))

        ;; selección de rutas
        (incf score
              (* 2
                 (count #\r cadena)))

        ;; selección e inserción de clientes
        (incf score
              (* 1
                 (count #\a cadena)))

        (incf score
              (* 1
                 (count #\b cadena)))

        ;; intercambio de clientes
        (incf score
              (* 3
                 (count #\c cadena)))

        ;; selección e inserción de subrutas
        (incf score
              (* 2
                 (count #\f cadena)))

        (incf score
              (* 2
                 (count #\g cadena)))

        ;; intercambio de subrutas
        (incf score
              (* 4
                 (count #\e cadena)))

        score)))


(defun ivns-frequency-balanced-p
       (cadena
        &key
          (limite-desequilibrio
           (get-config :max-imbalance 2)))

  "Filtro de balance simple por frecuencia de símbolos."

  (if (or (null cadena)
          (not (stringp cadena)))

      nil

      (let* ((r-count
              (count #\r cadena))

             (a-count
              (count #\a cadena))

             (b-count
              (count #\b cadena))

             (c-count
              (count #\c cadena))

             (f-count
              (count #\f cadena))

             (g-count
              (count #\g cadena))

             (e-count
              (count #\e cadena))

             (client-open
              a-count)

             (client-close
              (+ b-count
                 (* 2 c-count)))

             (subroute-open
              f-count)

             (subroute-close
              (+ g-count
                 (* 2 e-count))))

        (and
         (> r-count 0)

         (<= (abs (- client-open
                     client-close))
             limite-desequilibrio)

         (<= (abs (- subroute-open
                     subroute-close))
             limite-desequilibrio)))))


(defun ivns-balanced-structure-p (cadena)

  "Verifica si la cadena tiene una estructura razonablemente balanceada."

  (if (or (null cadena)
          (not (stringp cadena)))

      nil

      (let* ((opens
              (+ (count #\a cadena)
                 (count #\f cadena)))

             (closes
              (+ (count #\b cadena)
                 (* 2
                    (count #\c cadena))
                 (count #\g cadena)
                 (* 2
                    (count #\e cadena))))

             (max-imbalance
              (get-config :max-imbalance 2)))

        (<= (abs (- opens closes))
            max-imbalance))))


(defun ivns-expensive-pattern-p (cadena)

  "Detecta patrones que suelen generar vecindarios caros o cadenas poco útiles."

  (and cadena

       (or

        ;; repeticiones de rutas / clientes / subrutas
        (search "rfrfrf" cadena)
        (search "rarara" cadena)

        ;; demasiadas selecciones consecutivas
        (search "aaaa" cadena)
        (search "ffff" cadena)

        ;; demasiadas inserciones consecutivas
        (search "bbbb" cadena)
        (search "gggg" cadena)

        ;; swaps repetidos
        (search "ccc" cadena)
        (search "eee" cadena)

        ;; patrones que aparecen frecuentemente como vecinos NIL
        (search "rfff" cadena)
        (search "fffe" cadena)
        (search "fffeg" cadena)
        (search "rfffe" cadena)

        ;; combinaciones largas de clientes
        (search "raaa" cadena)
        (search "aaac" cadena))))


(defun ivns-semantic-structure-valid-p (cadena)

  "Valida la estructura semántica mínima de una cadena IVNS.

   Devuelve tres valores:
   1. T o NIL;
   2. razón textual;
   3. clave estable de rechazo.

   Esta función no evalúa el VRP real. Solo comprueba que la cadena no
   intente usar clientes, rutas o subrutas sin haberlos seleccionado antes."
  (if (null cadena)

      (values nil "Cadena NIL." :unknown)

      (let ((routes 0)
            (clients 0)
            (subroutes 0)
            (valid t)
            (reason ""))

        (loop
          for ch across cadena
          while valid
          do
            (case ch

              (#\r
               (incf routes))

              (#\a
               (if (> routes 0)
                   (incf clients)
                   (progn
                     (setf valid nil)
                     (setf reason "Aparece 'a' sin ruta seleccionada."))))

              (#\b
               (cond
                 ((<= routes 0)
                  (setf valid nil)
                  (setf reason "Aparece 'b' sin ruta disponible."))

                 ((<= clients 0)
                  (setf valid nil)
                  (setf reason "Aparece 'b' sin cliente seleccionado."))

                 (t
                  (decf clients))))

              (#\c
               (if (>= clients 2)
                   (decf clients 2)
                   (progn
                     (setf valid nil)
                     (setf reason "Aparece 'c' sin dos clientes seleccionados."))))

              (#\f
               (if (> routes 0)
                   (incf subroutes)
                   (progn
                     (setf valid nil)
                     (setf reason "Aparece 'f' sin ruta seleccionada."))))

              (#\g
               (cond
                 ((<= routes 0)
                  (setf valid nil)
                  (setf reason "Aparece 'g' sin ruta disponible."))

                 ((<= subroutes 0)
                  (setf valid nil)
                  (setf reason "Aparece 'g' sin subruta seleccionada."))

                 (t
                  (decf subroutes))))

              (#\e
               (if (>= subroutes 2)
                   (decf subroutes 2)
                   (progn
                     (setf valid nil)
                     (setf reason "Aparece 'e' sin dos subrutas seleccionadas."))))

              (otherwise
               (setf valid nil)
               (setf reason
                     (format nil
                             "Símbolo IVNS desconocido: ~a."
                             ch)))))

        (cond
          ((not valid)
           (values nil reason :semantic-invalid))

          ((> clients 0)
           (values nil
                   "La cadena termina con clientes seleccionados sin consumir."
                   :semantic-invalid))

          ((> subroutes 0)
           (values nil
                   "La cadena termina con subrutas seleccionadas sin consumir."
                   :semantic-invalid))

          (t
           (values t "ok" :ok))))))

(defun ivns-count-efg-symbols (cadena)
  "Cuenta cuántos símbolos de subruta aparecen en CADENA."
  (if cadena
      (+ (count #\e cadena)
         (count #\f cadena)
         (count #\g cadena))
      0))


(defun ivns-required-symbol-counts-p (cadena)
  "Verifica requisitos mínimos configurables para e/f/g."
  (let ((min-efg
         (get-config :min-efg-symbols 0))

        (min-f
         (get-config :min-f-symbols 0))

        (min-g
         (get-config :min-g-symbols 0))

        (min-e
         (get-config :min-e-symbols 0)))

    (cond

      ((< (ivns-count-efg-symbols cadena)
          min-efg)
       (values nil
               (format nil
                       "Pocos símbolos e/f/g: ~a < ~a."
                       (ivns-count-efg-symbols cadena)
                       min-efg)))

      ((< (count #\f cadena)
          min-f)
       (values nil
               (format nil
                       "Pocas f: ~a < ~a."
                       (count #\f cadena)
                       min-f)))

      ((< (count #\g cadena)
          min-g)
       (values nil
               (format nil
                       "Pocas g: ~a < ~a."
                       (count #\g cadena)
                       min-g)))

      ((< (count #\e cadena)
          min-e)
       (values nil
               (format nil
                       "Pocas e: ~a < ~a."
                       (count #\e cadena)
                       min-e)))

      (t
       (values t "ok")))))


(defun ivns-hard-expensive-pattern-p (cadena)
  "Detecta patrones extremadamente costosos."
  (and cadena
       (or
        (search "aaaaa" cadena)
        (search "fffff" cadena)
        (search "ggggg" cadena)
        (search "eeee" cadena)
        (search "cccc" cadena)
        (search "rfrfrfrf" cadena)
        (search "rararara" cadena))))


(defun ivns-expensive-pattern-forbidden-p
       (cadena allow-expensive-patterns)

  "Decide si una cadena debe rechazarse por patrón costoso.

   NIL   -> filtro estricto.
   :SOFT -> permite más f/g/e, pero bloquea extremos.
   T     -> permite patrones costosos."

  (cond

    ((eq allow-expensive-patterns t)
     nil)

    ((eq allow-expensive-patterns :soft)
     (ivns-hard-expensive-pattern-p cadena))

    (t
     (ivns-expensive-pattern-p cadena))))

(defun ivns-string-valid-p
       (cadena
        &key
          (max-imbalance
           (get-config :max-imbalance 2))

          (max-length
           (get-config :max-length 10))

          (max-complexity
           (get-config :max-complexity 14))

          (allow-expensive-patterns
           (get-config :allow-expensive-patterns nil)))

  "Filtro unificado de cadenas IVNS.

   Devuelve tres valores:
   1. T o NIL;
   2. razón textual;
   3. clave estable de rechazo o :ok."
  (cond
    ((null cadena)
     (values nil "Cadena NIL." :unknown))

    ((not (stringp cadena))
     (values nil "La cadena IVNS no es string." :unknown))

    ((= (length cadena) 0)
     (values nil "Cadena vacía." :too-short))

    ((> (length cadena)
        max-length)
     (values nil
             (format nil
                     "Longitud excesiva: ~a > ~a."
                     (length cadena)
                     max-length)
             :too-long))

    ((> (count #\r cadena)
        (get-config :max-r *r-limit*))
     (values nil
             (format nil
                     "Demasiadas rutas seleccionadas: ~a."
                     (count #\r cadena))
             :too-many-r))

    ((not
      (cadena-balanceada-p
       cadena
       :limite-desequilibrio max-imbalance))
     (values nil
             "Cadena desbalanceada por frecuencia de símbolos."
             :unbalanced))

    ((not
      (ivns-balanced-structure-p cadena))
     (values nil
             "Cadena desbalanceada estructuralmente."
             :unbalanced))

    ((> (ivns-complexity-score cadena)
        max-complexity)
     (values nil
             (format nil
                     "Complejidad excesiva: ~a > ~a."
                     (ivns-complexity-score cadena)
                     max-complexity)
             :too-long))

    ((and
      (not allow-expensive-patterns)
      (ivns-expensive-pattern-p cadena))
     (values nil
             "Cadena rechazada por patrón costoso."
             :forbidden-expensive-pattern))

    (t
     (multiple-value-bind
           (semantic-ok reason semantic-key)

         (ivns-semantic-structure-valid-p cadena)

       (if semantic-ok
           (values t "ok" :ok)
           (values nil reason semantic-key))))))

(defun ivns-reject-reason->key
       (reason)

  "Convierte una razón de rechazo de cadena IVNS en una clave estable.

   Las claves devueltas se usan para llenar los contadores:

   :too-many-r
   :too-short
   :too-long
   :unbalanced
   :missing-required-symbol
   :forbidden-expensive-pattern
   :semantic-invalid
   :duplicated-string
   :generation-limit-reached
   :unknown"

  (cond

    ((keywordp reason)
     reason)

    (t
     (let ((text
            (string-downcase
             (format nil "~a" reason))))

       (cond

         ((or (search "too-many-r" text)
              (search "r-limit" text)
              (search "max-r" text)
              (search "muchas r" text))
          :too-many-r)

         ((or (search "too-short" text)
              (search "short" text)
              (search "corta" text))
          :too-short)

         ((or (search "too-long" text)
              (search "long" text)
              (search "larga" text)
              (search "length" text))
          :too-long)

         ((or (search "unbalanced" text)
              (search "desbalance" text)
              (search "balance" text))
          :unbalanced)

         ((or (search "missing" text)
              (search "required" text)
              (search "requerido" text)
              (search "min-efg" text)
              (search "min-e" text)
              (search "min-f" text)
              (search "min-g" text))
          :missing-required-symbol)

         ((or (search "forbidden" text)
              (search "expensive" text)
              (search "costoso" text)
              (search "pattern" text))
          :forbidden-expensive-pattern)

         ((or (search "semantic" text)
              (search "semant" text)
              (search "estructura" text))
          :semantic-invalid)

         ((or (search "duplicated" text)
              (search "duplicate" text)
              (search "duplicada" text)
              (search "repetida" text))
          :duplicated-string)

         ((or (search "generation-limit" text)
              (search "limit" text)
              (search "limite" text)
              (search "límite" text)
              (search "agot" text))
          :generation-limit-reached)

         (t
          :unknown))))))  

(defun check-ambiguity
       (input-string
        &key
          (routes 0)
          (clients 0)
          (sub-routes 0))

  "Detecta si una cadena IVNS tiene ambigüedad o estructura inválida."

  (declare
   (ignore routes clients sub-routes))

  (multiple-value-bind
        (valid-p reason)

      (ivns-semantic-structure-valid-p
       input-string)

    (values
     (not valid-p)
     input-string
     reason)))
#+END_SRC
#+RESULTS:
: [exit 1]
: Unsupported src language: lisp

